<script setup lang="ts">
const emit = defineEmits<{
  (e: "start"): void;
}>();
</script>

<template>
  <base-container>
    <div class="home">
      <div class="logo">
        <img src="../assets/images/love.png" alt="love" />
      </div>
      <h1 class="title">Рівень симпатії і кохання</h1>
      <base-button @click="emit('start')">Пройти тест</base-button>
      <p>
        Розробка шкали рівня симпатії і кохання Рубіна, надала підтримку його
        теорії кохання. В ході дослідження, щоб визначити чи дійсно існує
        відмінність між симпатією і любов`ю, Рубін попросив, щоб люди прийняли
        участь в опитувальнику, грунтуючись на тому, як вони ставляться до
        людини, як до свого партнера або як до хорошого друга. Результати
        показали, що хороші друзі набрали високі бали за шкалою симпатії, і
        низькі бали за шкалою кохання.
      </p>
      <p>
        У своєму дослідженні, Рубін виявив ряд особливостей, які відрізняють
        ступеня кохання. Наприклад, він виявив, що учасники, які високо оцінили
        один одного за шкалою кохання, витратили набагато більше часу, дивлячись
        в очі, один одного, в порівнянні з тими, хто оцінив один одного низько.
      </p>
    </div>
  </base-container>
</template>

<style scoped>
p {
  text-align: left;
  line-height: 140%;
}

.home {
  margin-top: 3.75rem;
  text-align: center;
}

.title {
  margin: var(--section-gap) 0;
}
</style>
